Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Because TLS does not provide document oriented protection, it is impossible to determine whether the server has miscomputed the Content-Length or an attacker has truncated the connection.
zh_cn: 由于 TLS 不提供面向文档的保护，因此无法确定服务器是否错误计算了 Content-Length，或者攻击者是否截断了连接。

source: Because TLS is oblivious to HTTP request/response boundaries, it is necessary to examine the HTTP data itself (specifically the Content-Length header) to determine whether the truncation occurred inside a message or between messages.
zh_cn: 由于 TLS 无视 HTTP 请求/响应边界，因此有必要检查 HTTP 数据本身(特别是 Content-Length 首部)以确定截断是发生在消息内还是消息之间。

source: Because a Subject subscribes to an Observable, it will trigger that Observable to begin emitting items (if that Observable is “cold” — that is, if it waits for a subscription before it begins to emit items).
zh_cn: 因为 Subject 订阅了 Observable，它会触发 Observable 开始发射项目(如果 Observable 是“冷” - 也就是说，如果它在开始发射项目之前等待订阅)。

source: Because a URI is a sequence of characters, we must invert that relation in order to understand the URI syntax.
zh_cn: 因为 URI 是一系列字符，所以我们必须反转该关系才能理解 URI 语法。

source: Because both 1.x and 2.x is aimed at Java 6+, we can't use the Java 8 functional interfaces such as `java.util.function.Function`.
zh_cn: 因为 1.x 和 2.x 都是针对 Java 6+，所以我们不能使用 Java 8 的函数接口，例如 `java.util.function.Function`。

source: Because certificate validation requires that root keys be distributed independently, the self-signed certificate that specifies the root certificate authority MAY be omitted from the chain, under the assumption that the remote end must already possess it in order to validate it in any case.
zh_cn: 因为证书验证要求根密钥是独立分发的，所以可以在链中省略指定根证书颁发机构的自签名证书，假设远程端必须已经拥有它以便在任何情况下验证它。

source: Because certificate validation requires that trust anchors be distributed independently, a certificate that specifies a trust anchor MAY be omitted from the chain, provided that supported peers are known to possess any omitted certificates.
zh_cn: 由于证书验证要求独立分发信任锚，因此可以从链中省略指定信任锚的证书，前提是已知支持的对等端拥有任何省略的证书。

source: Because it is an observer, it can subscribe to one or more Observables, and because it is an Observable, it can pass through the items it observes by reemitting them, and it can also emit new items.
zh_cn: 因为它是一个观察者，它可以订阅一个或多个 Observable，并且因为它是一个 Observable，它可以通过重新发送来传递它所观察的项目，并且它也可以发射新项目。

source: Because of the presence of older implementations, the protocol allows ambiguous situations in which a client may send "Expect: 100- continue" without receiving either a 417 (Expectation Failed) status or a 100 (Continue) status.
zh_cn: 由于存在较旧的实现，该协议允许客户端可以发送“Expect: 100- continue”而不接收 417(期望失败)状态或 100(继续)状态的模糊情况。

source: Because steps 2 and 3 can be combined in a single message this is called the three way (or three message) handshake.
zh_cn: 因为步骤 2 和 3 可以组合在单个消息中，所以这称为三向(或三个消息)握手。

source: Because the ClientHello, EndOfEarlyData, ServerHello, Finished, and KeyUpdate messages can immediately precede a key change, implementations MUST send these messages in alignment with a record boundary.
zh_cn: 由于 ClientHello，EndOfEarlyData，ServerHello，Finished 和 KeyUpdate 消息可以紧接在密钥更改之前，因此实现必须将这些消息与记录边界对齐。

source: Because there could be at most 1 element emitted, the `Maybe` type has no notion of backpressure (because there is no buffer bloat possible as with unknown length `Flowable`s or `Observable`s.
zh_cn: 因为最多可以发射 1 个元素，所以 `Maybe` 类型没有背压概念(因为没有缓冲膨胀可能，而未知长度的 `Flowable` 或 `Observable` 则有这种可能。

source: Before 2.0.7, the operator `strict()` had to be applied in order to achieve the same level of compliance.
zh_cn: 在 2.0.7 之前，必须应用运算符 `strict()` 才能达到相同的合规水平。

source: Before making use of an "http" URI reference received from an untrusted source, a recipient SHOULD parse for userinfo and treat its presence as an error; it is likely being used to obscure the authority for the sake of phishing attacks.
zh_cn: 在使用从不受信任的来源收到的“http”URI 引用之前，接收者应该解析 userinfo 并将其存在视为错误；它可能被用来掩盖权限，以防网络钓鱼攻击。

source: Before we can discuss very much about the operation of the TCP we need to introduce some detailed terminology.
zh_cn: 在我们详细讨论 TCP 的操作之前，我们需要介绍一些详细的术语。

source: Being unbounded means as long as the JVM doesn't run out of memory, it can handle almost any amount coming from a bursty source.
zh_cn: 无限制意味着只要 JVM 没有内存耗尽，它几乎可以处理来自突发源的任何数量。

source: Beware that some older, erroneous implementations may not handle such data correctly when it is used as the base URI for relative references (Section 5.1), apparently because they fail to distinguish query data from path data when looking for hierarchical separators.
zh_cn: 请注意，当某些较旧的错误实现用作相对引用的基本 URI 时，可能无法正确处理此类数据(第 5.1 节)，这显然是因为它们在查找分层分隔符时无法区分查询数据和路径数据。

source: Beware that some older, erroneous implementations may not handle this data correctly when it is used as the base URI for relative references (Section 5.1).
zh_cn: 请注意，当某些较旧的错误实现用作相对引用的基 URI 时，它们可能无法正确处理此数据(第 5.1 节)。

source: Beyond the `PublishProcessor`above, there are other operators that don't support backpressure, mostly due to functional reasons.
zh_cn: 除了 `PublishProcessor` 之外，还有其他一些操作符不支持背压，主要是由于函数原因。

source: Binaries and dependency information for Maven, Ivy, Gradle and others can be found at [http://search.maven.org](http://search.maven.org/#search%7Cga%7C1%7Cio.reactivex.rxjava2).
zh_cn: 可以在 [http://search.maven.org](http://search.maven.org/#search%7Cga%7C1%7Cio.reactivex.rxjava2) 上找到 Maven，Ivy，Gradle 和其他的二进制文件和依赖信息。

source: Bit 6 shall be set to zero if the encoding is primitive, and shall be set to one if the encoding is constructed.
zh_cn: 如果编码是原始的，则第 6 位应设置为零，如果编码是结构，则应设置为 1。

source: Bits 8 to 1 of the first subsequent octet, followed by bits 8 to 1 of the second subsequent octet, followed in turn by bits 8 to 1 of each further octet up to and including the last subsequent octet, shall be the encoding of an unsigned binary integer equal to the number of octets in the contents octets, with bit 8 of the first subsequent octet as the most significant bit.
zh_cn: 第一个后续八位字节的第 8 位到第 1 位，接着是第二个后续八位字节的第 8 位到第 1 位，接着是每个另外的八位字节的第 8 位到第 1 位，直到并包括最后一个后续八位字节，应该是无符号二进制整数的编码，等于内容八位字节中的八位字节数，第一个后续八位字节的第 8 位作为最高有效位。

source: Bogus Content-Length header fields are now required to be handled as errors by recipients.
zh_cn: Bogus Content-Length 首部字段现在需要由接收者处理为错误。

source: Both `Publisher` and `SingleSource` appear as functional interfaces (types with one abstract method) and may encourage users to try to provide a lambda expression:
zh_cn: `Publisher` 和 `SingleSource` 都显示为函数接口(具有一个抽象方法的类型)，并且可能鼓励用户尝试提供 lambda 表达式：

source: Both mechanisms are obsoleted in TLS 1.3.
zh_cn: 这两种机制都在 TLS 1.3 中被废弃。

source: Both parties then convert the pre_master_secret into the master_secret, as specified above.
zh_cn: 双方随后将 pre_master_secret 转换为 master_secret，如上规定。

source: Both types of message consist of a start-line, zero or more header fields (also known as "headers"), an empty line (i.e., a line with nothing preceding the CRLF) indicating the end of the header fields, and possibly a message-body.
zh_cn: 两种类型的消息都包括一个起始行，零个或多个首部字段(也称为“headers”)，一个空行(即 CRLF 前面没有任何内容的行)，表示首部字段的结尾，可能还有一个消息正文。

source: Both users CLOSE simultaneously
zh_cn: 两个用户同时关闭

source: Both will, upon receiving these ACKs, delete the connection.
zh_cn: 收到这些 ACK 后，两者都将删除该连接。

source: Briefly the meanings of the states are:
zh_cn: 简而言之，各状态的意义是：

source: Browser Fingerprinting
zh_cn: 浏览器指纹识别

source: But as with Futures, while callbacks are easy to use with a single level of asynchronous execution, with nested composition they become unwieldy.
zh_cn: 但与 Futures 一样，虽然回调很容易使用单层的异步执行，但是 对于嵌套组合，它们难以处理。

source: But in ReactiveX, many instructions may execute in parallel and their results are later captured, in arbitrary order, by “observers.” Rather than calling a method, you define a mechanism for retrieving and transforming the data, in the form of an “Observable,” and then subscribe an observer to it, at which point the previously-defined mechanism fires into action with the observer standing sentry to capture and respond to its emissions whenever they are ready.
zh_cn: 但是在 ReactiveX 中，许多指令可以并行执行，并且它们的结果稍后由“观察者”以任意顺序捕获。你不用 调用 方法，而是定义一种获取和转换数据的机制，以“Observable”的形式，然后为它 subscribe (订阅) 一个观察者，一旦 Observable 发射的数据准备好，先前定义的机制就会发射数据，观察者表示的哨兵捕捉并作出响应。

source: But while in the Builder Pattern, the order in which the methods appear in the chain does not usually matter, with the Observable operators order matters.
zh_cn: 但是在 Builder 模式中，方法在链中出现的顺序通常并不重要，而 Observable 操作符是 顺序重要的。

source: By contrast, with an Observable the producer pushes values to the consumer whenever values are available.
zh_cn: 相比之下，对于 Observable，只要值可用，生产者就会将值推送给消费者。

source: By convention, in this document, calls to onNext are usually called “emissions” of items, whereas calls to onCompleted or onError are called “notifications.”
zh_cn: 按照惯例，在本文档中，对 onNext 的调用通常称为项目的“发射 (emissions)”，而对 onCompleted 或 onError 的调用称为“通知 (notifications)”。

source: By convention, standardized methods are defined in all-uppercase US-ASCII letters.
zh_cn: 按照惯例，标准化方法以全大写的 US-ASCII 字母定义。

source: By convention, the products are listed in order of their significance for identifying the application.
zh_cn: 按照惯例，产品按其对于识别应用程序的重要性的顺序列出。

source: By default, an Observable and the chain of operators that you apply to it will do its work, and will notify its observers, on the same thread on which its Subscribe method is called.
zh_cn: 默认情况下，Observable 和应用于它的操作符链将完成其工作，并通知其观察者，在调用其 Subscribe 方法的同一线程上。

source: By having `Publisher` as input this way, you can compose with other Reactive-Streams compliant libraries without the need to wrap them or convert them into `Flowable` first.
zh_cn: 通过以这种方式输入 `Publisher`，您可以使用其他符合 Reactive-Streams 标准的库进行组合，而无需先将它们包装或转换为 `Flowable`。

source: By the terms of the Observable contract, it may call onNext zero or more times, and then may follow those calls with a call to either onCompleted or onError but not both, which will be its last call.
zh_cn: 根据 Observable 协议 的定义，它可以调用 onNext 零次或多次，然后这些调用可能跟随 onCompleted 或 onError ，但不会同时，这将是它的最后一次调用。

source: By themselves they’d be nothing more than a slight extension of the standard observer pattern, better suited to handling a sequence of events rather than a single callback.
zh_cn: 它们本身只不过是标准观察者模式的轻微扩展，使其更适合处理一系列事件而不是单个回调。

source: CHAR = <any US-ASCII character (octets 0 - 127)>
zh_cn: CHAR = <任何 US-ASCII 字符(八位字节 0 - 127)>

source: CLOSE is an operation meaning "I have no more data to send." The notion of closing a full-duplex connection is subject to ambiguous interpretation, of course, since it may not be obvious how to treat the receiving side of the connection.
zh_cn: CLOSE 是一项操作，意思是“我没有更多数据要发送”。当然，关闭全双工连接的概念会受到模糊解释，因为如何处理连接的接收方可能并不明显。

source: CLOSE-WAIT - represents waiting for a connection termination request from the local user.
zh_cn: CLOSE-WAIT - 表示等待本地用户的连接终止请求。

source: CLOSED - represents no connection state at all.
zh_cn: CLOSED - 表示根本没有连接状态。

source: CLOSED is fictional because it represents the state when there is no TCB, and therefore, no connection.
zh_cn: CLOSED 是虚构的，因为它表示没有 TCB 时的状态，因此没有连接。

source: CLOSING - represents waiting for a connection termination request acknowledgment from the remote TCP.
zh_cn: CLOSING - 表示等待来自远程 TCP 的连接终止请求确认。

source: CONNECT is a new, special case in determining message body length.
zh_cn: CONNECT 是确定邮件正文长度的一个新的特殊情况。

source: CONNECT is intended only for use in requests to a proxy.
zh_cn: CONNECT 仅用于对代理的请求。

source: CR = <US-ASCII CR, carriage return (13)>
zh_cn: CR = <US-ASCII CR, 回车(13)>

source: CTL = <any US-ASCII control character (octets 0 - 31) and DEL (127)>
zh_cn: CTL = <任何 US-ASCII 控制字符(八位字节 0-31)和 DEL(127)>

source: Cache Correctness
zh_cn: 缓存正确性

source: Cache Replacement
zh_cn: 缓存替换

source: Cache requirements for incomplete responses are defined in Section 3 of [RFC7234].
zh_cn: 不完整响应的缓存要求在 [RFC7234] 的第 3 节中定义。

source: Cache-control Mechanisms
zh_cn: 缓存控制机制

source: Cacheable Methods
zh_cn: 可缓存方法

source: Caches
zh_cn: 缓存

source: Caching Negotiated Responses
zh_cn: 缓存协商响应

source: Caching in HTTP
zh_cn: 在 HTTP 中缓存

source: Call a method.
zh_cn: 调用方法。

source: Callbacks Have Their Own Problems
zh_cn: 使用回调会有问题

source: Callbacks solve the problem of premature blocking on Future.get() by not allowing anything to block.
zh_cn: 回调通过不允许任何阻塞来解决 Future.get() 上的过早阻塞问题。

source: Canonicalization and Text Defaults
zh_cn: 规范化和文本默认值

source: Case 1: A single octet of option-kind.
zh_cn: 情况 1：选项类型的单个八位字节。

source: Case 1: Local user initiates the close
zh_cn: 情况 1：本地用户启动关闭

source: Case 2: An octet of option-kind, an octet of option-length, and the actual option-data octets.
zh_cn: 情况 2：选项类型的八位字节，选项长度的八位字节和实际的选项 - 数据八位字节。

source: Case 2: TCP receives a FIN from the network
zh_cn: 情况 2：TCP 从网络接收 FIN

source: Case 3: both users close simultaneously
zh_cn: 案例 3：两个用户同时关闭

source: Case arms have limited fall-through: if two case arms follow in immediate succession with no fields in between, then they both contain the same fields.
zh_cn: case arm 有限制性的落下通过：如果两个 case arm 紧随其后，中间没有任何领域，那么它们都包含相同的领域。

source: Certain basic rules are in uppercase, such as SP, LWS, HT, CRLF, DIGIT, ALPHA, etc.
zh_cn: 某些基本规则是大写的，例如 SP，LWS，HT，CRLF，DIGIT，ALPHA 等。

source: Certain buggy HTTP/1.0 client implementations generate extra CRLF's after a POST request.
zh_cn: 某些错误的 HTTP/1.0 客户端实现在 POST 请求后生成额外的 CRLF。

source: Certificate: The certificate of the endpoint and any per-certificate extensions.
zh_cn: Certificate：端点证书和任何每个证书扩展。

source: Certificate: The certificate to be used for authentication, and any supporting certificates in the chain.
zh_cn: Certificate：用于身份验证的证书以及链中的任何支持证书。

source: CertificateRequest: if certificate-based client authentication is desired, the desired parameters for that certificate.
zh_cn: CertificateRequest：如果需要基于证书的客户端身份验证，则为该证书的所需参数。

source: CertificateVerify: A signature over the entire handshake using the private key corresponding to the public key in the Certificate message.
zh_cn: CertificateVerify：使用与证书消息中的公钥对应的私钥在整个握手中签名。

source: CertificateVerify: A signature over the value Transcript-Hash(Handshake Context, Certificate).
zh_cn: CertificateVerify：值 Transcript-Hash(握手上下文，证书)的签名。

source: Certificates that are self-signed or certificates that are expected to be trust anchors are not validated as part of the chain and therefore MAY be signed with any algorithm.
zh_cn: 自签名的证书或预期为信任锚的证书不会作为链的一部分进行验证，因此可以使用任何算法进行签名。

source: Chaining Operators
zh_cn: 链接操作符

source: Change Cipher Spec Protocol
zh_cn: 更改加密规范协议

source: Changes from HTTP/1.0
zh_cn: 来自 HTTP/1.0 的更改

source: Changes from RFC 2068
zh_cn: 从 RFC 2068 的变更

source: Changes from RFC 2616
zh_cn: RFC 2616 的变更

source: Character Sets
zh_cn: 字符集

source: Characters
zh_cn: 字符

source: Characters other than those in the "reserved" and "unsafe" sets (see RFC 2396 [42]) are equivalent to their ""%" HEX HEX" encoding.
zh_cn: 除“保留”和“不安全”集合之外的字符(参见 RFC 2396 [42])等同于它们的 ""%" HEX HEX" 编码。

source: Characters other than those in the "reserved" set are equivalent to their percent-encoded octets: the normal form is to not encode them (see Sections 2.1 and 2.2 of [RFC3986]).
zh_cn: 除“保留”集合中的字符以外的字符等同于它们的百分比编码八位字节：正常形式是不对它们进行编码(参见 [RFC3986] 的第 2.1 和 2.2 节)。

source: Characters that are allowed in a URI but do not have a reserved purpose are called unreserved.
zh_cn: URI 中允许但没有保留目的的字符称为 unreserved。

source: Checking or Setting Unsubscribed Status
zh_cn: 检查或设置取消订阅状态

source: Chunk Extensions
zh_cn: 块扩展

source: Chunk length does not include the count of the octets in the chunk header and trailer.
zh_cn: 块长度不包括块首部和尾部中八位字节的计数。

source: Chunked Trailer Part
zh_cn: 块 Trailer 部分

source: Chunked Transfer Coding
zh_cn: 块传输编码

source: Client Behavior
zh_cn: 客户端行为

source: Client Behavior if Server Prematurely Closes Connection
zh_cn: 服务器过早关闭连接时的客户端行为

source: Client Behavior if Server Prematurely Closes Connection ..50
zh_cn: 服务器过早关闭连接时的客户端行为 ..50

source: Client Certificate Selection
zh_cn: 客户证书选择

source: Client Identity
zh_cn: 客户标识

source: Client certificates are sent using the Certificate structure defined in Section 7.4.2.
zh_cn: 使用第 7.4.2 节中定义的 Certificate 结构发送客户端证书。

source: Client code treats all of its interactions with Observables as asynchronous, whether your underlying implementation is blocking or non-blocking and however you choose to implement it.
zh_cn: 客户端代码将其与 Observable 的所有交互视为异步，无论您的底层实现是阻塞还是非阻塞，无论您选择什么实现它。

source: Client implementations MUST always send the correct version number in PreMasterSecret.
zh_cn: 客户端实现必须始终在 PreMasterSecret 中发送正确的版本号。

source: Client message boundaries are not preserved in the record layer (i.e., multiple client messages of the same ContentType MAY be coalesced into a single TLSPlaintext record, or a single message MAY be fragmented across several records).
zh_cn: 客户端消息边界不保留在记录层中(即，相同 ContentType 的多个客户端消息可以合并为单个 TLSPlaintext 记录，或者单个消息可以跨多个记录分段)。

source: Client request:
zh_cn: 客户端请求：

source: Client software SHOULD reopen the transport connection and retransmit the aborted sequence of requests without user interaction so long as the request sequence is idempotent (see section 9.1.2).
zh_cn: 客户端软件应该重新打开传输连接并重新传输请求的中止序列而无需用户交互，只要请求序列是幂等的(参见第 9.1.2 节)。

source: Client-controlled Behavior
zh_cn: 客户控制的行为

source: Client/Server Messaging
zh_cn: 客户端/服务器消息传递

source: Clients MAY request extended functionality from servers by sending data in the extensions field.
zh_cn: 客户端可以通过在扩展字段中发送数据来请求服务器的扩展功能。

source: Clients MAY send an empty client_shares vector in order to request group selection from the server, at the cost of an additional round trip (see Section 4.1.4).
zh_cn: 客户端可以发送一个空的 client_shares vector，以便从服务器请求组选择，但需要额外的往返(参见第 4.1.4 节)。

source: Clients MUST NOT act upon any information found in "supported_groups" prior to successful completion of the handshake but MAY use the information learned from a successfully completed handshake to change what groups they use in their "key_share" extension in subsequent connections.
zh_cn: 在成功完成握手之前，客户端不得对“supported_groups”中的任何信息进行操作，但可以使用从成功完成的握手中获知的信息来更改在后续连接中他们在“key_share”扩展中使用的组。

source: Clients MUST NOT include MD5 and SHA-1 in CertificateVerify message.
zh_cn: 客户端不得在 CertificateVerify 消息中包含 MD5 和 SHA-1。

source: Clients MUST NOT offer any KeyShareEntry values for groups not listed in the client's "supported_groups" extension.
zh_cn: 客户端不得为客户端的“supported_groups”扩展中未列出的组提供任何 KeyShareEntry 值。

source: Clients MUST NOT offer it if they are offering prior versions.
zh_cn: 如果他们提供以前的版本，客户不得提供它。

source: Clients MUST NOT offer multiple KeyShareEntry values for the same group.
zh_cn: 客户端不得为同一组提供多个 KeyShareEntry 值。

source: Clients MUST NOT use cookies in their initial ClientHello in subsequent connections.
zh_cn: 客户端在后续连接中不得在其初始 ClientHello 中使用 cookie。

source: Clients MUST abort the handshake with an "illegal_parameter" alert if the HelloRetryRequest would not result in any change in the ClientHello.
zh_cn: 如果 HelloRetryRequest 不会导致 ClientHello 发生任何变化，客户端必须使用“illegal_parameter”警报中止握手。

source: Clients MUST also be prepared to resend their requests if the server closes the connection before sending all of the corresponding responses.
zh_cn: 如果服务器在发送所有相应的响应之前关闭连接，客户端也必须准备重新发送请求。

source: Clients MUST be prepared to do a full negotiation -- including negotiating new cipher suites -- during any handshake.
zh_cn: 客户必须准备好在任何握手期间进行完整的协商 - 包括协商新的加密套件。

source: Clients MUST check for this extension prior to processing the rest of the ServerHello (although they will have to parse the ServerHello in order to read the extension).
zh_cn: 客户端必须在处理 ServerHello 的其余部分之前检查此扩展(尽管他们必须解析 ServerHello 才能读取扩展)。

source: Clients MUST ignore unrecognized extensions.
zh_cn: 客户端必须忽略无法识别的扩展。

source: Clients MUST send a closure alert before closing the connection.
zh_cn: 客户端必须在关闭连接之前发送关闭警报。

source: Clients MUST send this message whenever authenticating via a certificate (i.e., when the Certificate message is non-empty).
zh_cn: 每当通过证书进行身份验证时(即，当证书消息非空时)，客户端必须发送此消息。

source: Clients SHOULD NOT include MD5 and SHA-1 in signature_algorithms extension.
zh_cn: 客户端不应该在 signature_algorithms 扩展中包含 MD5 和 SHA-1。

source: Clients SHOULD NOT pipeline requests using non-idempotent methods or non-idempotent sequences of methods (see section 9.1.2).
zh_cn: 客户端不应该使用非幂等方法或非幂等方法序列来流水线请求(请参阅第 9.1.2 节)。

source: Clients and servers SHOULD NOT assume that a persistent connection is maintained for HTTP versions less than 1.1 unless it is explicitly signaled.
zh_cn: 客户端和服务器不应该假设为小于 1.1 的 HTTP 版本维护持久连接，除非明确发出信号。

source: Clients and servers SHOULD both constantly watch for the other side of the transport close, and respond to it as appropriate.
zh_cn: 客户和服务器应该经常关注运输关闭的另一侧，并在适当时对其进行响应。

source: Clients and servers are not required to use these formats for user presentation, request logging, etc.
zh_cn: 客户端和服务器不需要使用这些格式进行用户演示，请求记录等。

source: Clients can offer as many KeyShareEntry values as the number of supported groups it is offering, each representing a single set of key exchange parameters.
zh_cn: 客户端可以提供与其提供的支持组数量一样多的 KeyShareEntry 值，每个值代表一组密钥交换参数。

source: Clients offering these values MUST list them as the lowest priority (listed after all other algorithms in SignatureSchemeList).
zh_cn: 提供这些值的客户端必须将它们列为最低优先级(在 SignatureSchemeList 中的所有其他算法之后列出)。

source: Clients sending 0-RTT data as described in Section 4.2.10.
zh_cn: 客户端发送 0-RTT 数据，如第 4.2.10 节所述。

source: Clients that use persistent connections SHOULD limit the number of simultaneous connections that they maintain to a given server.
zh_cn: 使用持久连接的客户端应该限制它们维护到给定服务器的同时连接数。

source: Clients using future versions of HTTP might optimistically try a new feature, but if communicating with an older server, retry with old semantics after an error is reported.
zh_cn: 使用未来版本的 HTTP 的客户端可能会乐观地尝试新功能，但如果与旧服务器通信，则在报告错误后重试旧语义。

source: Clients which are unprepared to receive any more data MAY choose not to wait for the server's closure alert and simply close the connection, thus generating an incomplete close on the server side.
zh_cn: 没有准备好接收任何数据的客户可以选择不等待服务器的关闭警报并简单地关闭连接，从而在服务器端生成不完整的关闭。

source: Clients which assume persistent connections and pipeline immediately after connection establishment SHOULD be prepared to retry their connection if the first pipelined attempt fails.
zh_cn: 在连接建立后立即采用持久连接和流水线的客户端应准备好在第一次流水线尝试失败时重试其连接。

source: Clients which desire the server to authenticate itself via a certificate MUST send the "signature_algorithms" extension.
zh_cn: 希望服务器通过证书进行身份验证的客户端必须发送“signature_algorithms”扩展。

source: Clocks are not required to be set correctly by the basic TLS protocol;
zh_cn: 基本 TLS 协议不需要正确设置时钟；

source: Closing a Connection
zh_cn: 关闭连接

source: Closure Alerts
zh_cn: 关闭警报

source: Combining Byte Ranges
zh_cn: 组合字节范围

source: Combining Headers
zh_cn: 组合首部

source: Combining Observables
zh_cn: 结合 Observable

source: Comments appear in parentheses.
zh_cn: 注释显示在括号中。

source: Comments are only allowed in fields containing "comment" as part of their field value definition.
zh_cn: 注释仅允许在包含“注释”的字段中作为其字段值定义的一部分。

source: Comments begin with "/*" and end with "*/".
zh_cn: 注释以“/*”开头，以“*/”结尾。

source: Comments can be included in some HTTP header fields by surrounding the comment text with parentheses.
zh_cn: 通过用括号括起注释文本，可以在一些 HTTP 头字段中包含注释。

source: Common HTTP user agents include household appliances, stereos, scales, firmware update scripts, command-line programs, mobile apps, and communication devices in a multitude of shapes and sizes.
zh_cn: 常见的 HTTP 用户代理包括多种形状和大小的家用电器，立体声，音阶，固件更新脚本，命令行程序，移动应用程序和通信设备。

source: Common Method Properties
zh_cn: 常用方法属性

source: Comparison Ladder
zh_cn: 比较梯

source: Compatibility with HTTP/1.0 Persistent Connections
zh_cn: 与 HTTP/1.0 持久连接的兼容性

source: Compatibility with Previous Versions
zh_cn: 与先前版本的兼容性

source: Compliance Requirements
zh_cn: 合规要求

source: Composition via Observable Operators
zh_cn: 通过 Observable 操作符组合

source: Composition via Single Operators
zh_cn: Single 操作符组合
